export const DEFAULT_QUESTIONS = [
  "あなたの最大の短所は何ですか？",
  "困難な課題に直面した時のことを教えてください。",
  "5年後の自分はどうなっていると思いますか？",
  "なぜここで働きたいのですか？",
  "あなたが情熱を注いでいることは何ですか？",
  "あなたの理想的な職場環境について説明してください。",
  "ストレスやプレッシャーにどう対処しますか？",
  "あなたの最大の功績は何ですか？",
  "何かの決定に同意できなかった時のことを教えてください。",
  "あなたのモチベーションの源泉は何ですか？",
  "どのように管理されるのが好きですか？",
  "最近読んだ本は何ですか？",
  "もしスーパーパワーを持てるとしたら、何を選びますか？",
  "あなたの好きな趣味は何ですか？",
  "自分を3つの言葉で説明してください。",
  "どのようにして整理整頓をしていますか？",
  "楽しみのために何をしますか？",
  "失敗した時のことを教えてください。",
  "あなたのキャリアの目標は何ですか？"
];

export const ADMIN_PASSWORD = "admin";
export const MAX_QUESTIONS = 200;

// Palette: Red, Orange, Yellow, Lime, Emerald, Sky, Blue, Violet, Pink
export const POP_COLORS = ['#fecaca', '#fed7aa', '#fef08a', '#d9f99d', '#a7f3d0', '#bae6fd', '#bfdbfe', '#ddd6fe', '#fbcfe8'];